package ua.kpi.practical_example_8

/**
 * Enum-клас, який визначає рівні відображення (display) для різних рівнів складності.
 * Використовується для позначення того, на якому рівні повинна бути показана інформація.
 */
enum class DisplayFor {
    /**
     * Базовий рівень відображення.
     * Використовується для простих, загальних даних.
     */
    BASIC_LEVEL,
    
    /**
     * Середній рівень відображення.
     * Використовується для більш детальної інформації.
     */
    MIDDLE_LEVEL,
    
    /**
     * Розширений рівень відображення.
     * Використовується для детального аналізу та професійних даних.
     */
    ADVANCED_LEVEL,
}