package ua.kpi.practical_example_7

/**
 * Enum-клас, який визначає рівні відображення (display) для користувачів.
 * Використовується для позначення рівня доступу або складності інформації,
 * яку потрібно відображати користувачеві.
 */
enum class DisplayFor {
    /**
     * Базовий рівень відображення.
     * Відповідає мінімальному набору інформації, який може бути корисним для початківця.
     */
    BASIC_LEVEL,
    
    /**
     * Середній рівень відображення.
     * Включає більше інформації, ніж базовий рівень, але менше, ніж продвинутий.
     */
    MIDDLE_LEVEL,
    
    /**
     * Продвинутий рівень відображення.
     * Відображає повну або майже повну інформацію, призначена для досвідчених користувачів.
     */
    ADVANCED_LEVEL,
}