package ua.kpi.practical_example_27.ui.theme

import androidx.compose.ui.graphics.Color

// Основний фіолетовий колір для теми з прозорістю 80% (використовується для головних елементів інтерфейсу)
val Purple80 = Color(0xFFD0BCFF)

// Сірий фіолетовий колір для теми з прозорістю 80% (використовується для вторинних елементів інтерфейсу)
val PurpleGrey80 = Color(0xFFCCC2DC)

// Рожевий колір для теми з прозорістю 80% (використовується для акцентних елементів)
val Pink80 = Color(0xFFEFB8C8)

// Основний фіолетовий колір для теми з прозорістю 40% (використовується для менш важливих елементів або при наведенні)
val Purple40 = Color(0xFF6650a4)

// Сірий фіолетовий колір для теми з прозорістю 40% (використовується для вторинних елементів інтерфейсу при наведенні)
val PurpleGrey40 = Color(0xFF625b71)

// Рожевий колір для теми з прозорістю 40% (використовується для акцентних елементів при наведенні)
val Pink40 = Color(0xFF7D5260)