package ua.kpi.practical_example_23

/**
 * Enum-клас, який визначає рівні відображення (display) для користувачів.
 * Використовується для позначення рівня доступу або складності інформації,
 * яка відображається користувачеві.
 */
enum class DisplayFor {
    /**
     * Базовий рівень відображення.
     * Відповідає мінімальному набору інформації, що доступна користувачеві.
     */
    BASIC_LEVEL,

    /**
     * Середній рівень відображення.
     * Включає більше деталей порівняно з базовим рівнем, але менше ніж у розширеному.
     */
    MIDDLE_LEVEL,

    /**
     * Розширений рівень відображення.
     * Найбільш повна інформація, доступна для користувача з високим рівнем доступу.
     */
    ADVANCED_LEVEL,
}