package ua.kpi.practical_example_9.basic

// ------------------------------------------------------
// Модель даних (entity для локального сховища)
// ------------------------------------------------------
// Клас SolarForecast використовується для представлення прогнозу сонячної енергії.
// Він містить три основних поля:
// - id: унікальний ідентифікатор запису
// - day: день, на який зроблено прогноз (у вигляді рядка)
// - predictedPower: передбачувана потужність сонячної енергії (у вигляді дробного числа)
data class SolarForecast(
    val id: Int,
    val day: String,
    val predictedPower: Double
)