package ua.kpi.practical_example_24

/**
 * Enum-клас, який визначає рівні відображення (display) для користувачів.
 * Використовується для позначення рівня доступу або складності інтерфейсу,
 * який відображається для користувача в залежності від його досвіду або ролі.
 *
 * Можливі значення:
 * - BASIC_LEVEL: базовий рівень відображення, найпростіший інтерфейс
 * - MIDDLE_LEVEL: середній рівень відображення, більше функціональності
 * - ADVANCED_LEVEL: продвинутий рівень відображення, повний функціонал
 */
enum class DisplayFor {
    BASIC_LEVEL,     // Базовий рівень відображення
    MIDDLE_LEVEL,    // Середній рівень відображення
    ADVANCED_LEVEL,  // Продвинутий рівень відображення
}