package ua.kpi.practical_example_21

/**
 * Enum-клас, який визначає рівні відображення (display) для різних рівнів складності.
 * Використовується для позначення того, на якому рівні повинна відображатися інформація
 * у залежності від складності завдання або рівня знань користувача.
 */
enum class DisplayFor {
    /**
     * Базовий рівень відображення. Використовується для простих завдань або початківців.
     */
    BASIC_LEVEL,

    /**
     * Середній рівень відображення. Використовується для завдань середнього рівня складності.
     */
    MIDDLE_LEVEL,

    /**
     * Продвинутий рівень відображення. Використовується для складних завдань або досвідчених користувачів.
     */
    ADVANCED_LEVEL,
}