package ua.kpi.practical_example_22

/**
 * Enum-клас, який визначає рівні відображення (display) для користувачів.
 * Використовується для позначення рівня складності контенту або інтерфейсу,
 * який показується користувачеві в залежності від його досвіду або потреб.
 */
enum class DisplayFor {
    /**
     * Базовий рівень відображення.
     * Відповідає простому інтерфейсу, який легко зрозуміти новачкам.
     */
    BASIC_LEVEL,
    
    /**
     * Середній рівень відображення.
     * Відповідає інтерфейсу з більшою кількістю функціоналу,
     * призначений для користувачів із середнім рівнем досвіду.
     */
    MIDDLE_LEVEL,
    
    /**
     * Продуктивний (авансований) рівень відображення.
     * Відповідає повному інтерфейсу з усіма функціями,
     * призначений для досвідчених користувачів.
     */
    ADVANCED_LEVEL,
}