package ua.kpi.practical_example_15

/**
 * Перелік (enum) для визначення рівнів відображення користувача.
 * Використовується для позначення рівня складності або доступу до функціоналу,
 * який може бути показаний користувачеві.
 */
enum class DisplayFor {
    /**
     * Базовий рівень відображення.
     * Відповідає мінімальному набору функціоналу або інформації.
     */
    BASIC_LEVEL,
    
    /**
     * Середній рівень відображення.
     * Включає додатковий функціонал, який доступний для середнього користувача.
     */
    MIDDLE_LEVEL,
    
    /**
     * Розширений рівень відображення.
     * Відповідає повному набору функціоналу або інформації, доступній для продвинутого користувача.
     */
    ADVANCED_LEVEL,
}