package ua.kpi.practical_example_17

/**
 * Enum-клас, який визначає рівні відображення (display) для різних рівнів складності.
 * Використовується для позначення того, на якому рівні повинна бути показана інформація
 * або функціональність у програмі.
 */
enum class DisplayFor {
    /**
     * Базовий рівень відображення. Використовується для найпростіших елементів інтерфейсу.
     */
    BASIC_LEVEL,
    
    /**
     * Середній рівень відображення. Використовується для елементів з середньою складністю або
     * додатковими функціями.
     */
    MIDDLE_LEVEL,
    
    /**
     * Розширений рівень відображення. Використовується для складних елементів інтерфейсу або
     * функціональності, які доступні лише після певного рівня навичок користувача.
     */
    ADVANCED_LEVEL,
}