package ua.kpi.practical_example_17.ui.theme

import androidx.compose.ui.graphics.Color

// Основний фіолетовий колір для теми з прозорістю 80% (використовується для головних елементів інтерфейсу)
val Purple80 = Color(0xFFD0BCFF)

// Сіро-фіолетовий колір для теми з прозорістю 80% (використовується для вторинних елементів інтерфейсу)
val PurpleGrey80 = Color(0xFFCCC2DC)

// Рожевий колір для теми з прозорістю 80% (використовується для акцентних елементів інтерфейсу)
val Pink80 = Color(0xFFEFB8C8)

// Основний фіолетовий колір для теми з прозорістю 40% (використовується для менш важливих елементів інтерфейсу)
val Purple40 = Color(0xFF6650a4)

// Сіро-фіолетовий колір для теми з прозорістю 40% (використовується для менш важливих елементів інтерфейсу)
val PurpleGrey40 = Color(0xFF625b71)

// Рожевий колір для теми з прозорістю 40% (використовується для менш важливих елементів інтерфейсу)
val Pink40 = Color(0xFF7D5260)