package ua.kpi.practical_example_4.ui.theme

import androidx.compose.ui.graphics.Color

// Основні кольори для теми додатку
// Purple80 - світлий фіолетовий колір, використовується для основних елементів інтерфейсу
val Purple80 = Color(0xFFD0BCFF)

// PurpleGrey80 - сіро-фіолетовий колір, використовується для вторинних елементів інтерфейсу
val PurpleGrey80 = Color(0xFFCCC2DC)

// Pink80 - рожевий колір, використовується для акцентних елементів інтерфейсу
val Pink80 = Color(0xFFEFB8C8)

// Темні версії кольорів для темної теми
// Purple40 - темний фіолетовий колір, використовується для основних елементів інтерфейсу в темній темі
val Purple40 = Color(0xFF6650a4)

// PurpleGrey40 - темний сіро-фіолетовий колір, використовується для вторинних елементів інтерфейсу в темній темі
val PurpleGrey40 = Color(0xFF625b71)

// Pink40 - темний рожевий колір, використовується для акцентних елементів інтерфейсу в темній темі
val Pink40 = Color(0xFF7D5260)