package ua.kpi.practical_example_19

/**
 * Enum-клас, який визначає рівні відображення (display) для користувачів.
 * Використовується для позначення рівня доступу або складності інтерфейсу,
 * який показується кінцевому користувачеві.
 */
enum class DisplayFor {
    /**
     * Базовий рівень відображення.
     * Відповідає мінімальному набору функціональності або інтерфейсу.
     */
    BASIC_LEVEL,
    
    /**
     * Середній рівень відображення.
     * Включає більше функцій та можливостей порівняно з базовим рівнем.
     */
    MIDDLE_LEVEL,
    
    /**
     * Просунутий рівень відображення.
     * Найбільш повний і складний інтерфейс, який може містити всі функції та опції.
     */
    ADVANCED_LEVEL,
}