package ua.kpi.practical_example_3

/**
 * Enum-клас, який визначає рівні відображення (display) для користувачів.
 * Використовується для позначення рівня складності інформації, яку потрібно показати користувачеві.
 */
enum class DisplayFor {
    /**
     * Базовий рівень відображення.
     * Відповідає простому, зрозумілому представленню інформації.
     */
    BASIC_LEVEL,
    
    /**
     * Середній рівень відображення.
     * Відповідає детальнішому представленню інформації з деякими технічними деталями.
     */
    MIDDLE_LEVEL,
    
    /**
     * Розширений рівень відображення.
     * Відповідає повному, технічному представленню інформації.
     */
    ADVANCED_LEVEL,
}