package ua.kpi.practical_example_18

/**
 * Enum-клас, який визначає рівні відображення (display) для користувачів.
 * Використовується для позначення рівня доступу або складності інтерфейсу,
 * який показується користувачеві в залежності від його досвіду або ролі.
 */
enum class DisplayFor {
    /**
     * Базовий рівень відображення.
     * Відповідає простому інтерфейсу, який підходить для новачків або початківців.
     */
    BASIC_LEVEL,
    
    /**
     * Середній рівень відображення.
     * Включає більше функціоналу та можливостей, підходить для користувачів з середнім досвідом.
     */
    MIDDLE_LEVEL,
    
    /**
     * Розширений рівень відображення.
     * Призначений для досвідчених користувачів, які потребують повного функціоналу системи.
     */
    ADVANCED_LEVEL,
}