package ua.kpi.practical_example_10

/**
 * Enum-клас, що визначає рівні відображення (display) для різних рівнів складності.
 * Використовується для позначення того, який рівень інформації повинен бути показаний користувачеві.
 */
enum class DisplayFor {
    /**
     * Базовий рівень відображення.
     * Відповідає мінімальному набору інформації.
     */
    BASIC_LEVEL,

    /**
     * Середній рівень відображення.
     * Відповідає середньому набору інформації.
     */
    MIDDLE_LEVEL,

    /**
     * Просунутий рівень відображення.
     * Відповідає повному або розширеним набором інформації.
     */
    ADVANCED_LEVEL,
}