package ua.kpi.practical_example_16

/**
 * Enum-клас, який визначає рівні відображення (display) для різних рівнів складності.
 * Використовується для позначення того, на якому рівні повинна бути показана інформація
 * в залежності від складності завдання або користувача.
 */
enum class DisplayFor {
    /**
     * Базовий рівень відображення.
     * Використовується для простих завдань або початківців.
     */
    BASIC_LEVEL,
    
    /**
     * Середній рівень відображення.
     * Використовується для завдань середнього рівня складності.
     */
    MIDDLE_LEVEL,
    
    /**
     * Розширений рівень відображення.
     * Використовується для складних завдань або досвідчених користувачів.
     */
    ADVANCED_LEVEL,
}