package ua.kpi.practical_example_25

/**
 * Перелік (enum) для визначення рівнів відображення користувача.
 * Використовується для позначення рівня складності або доступу до функціоналу,
 * який може бути показаний користувачеві.
 */
enum class DisplayFor {
    /**
     * Базовий рівень відображення.
     * Відповідає мінімальному набору інформації або функціоналу.
     */
    BASIC_LEVEL,

    /**
     * Середній рівень відображення.
     * Включає додатковий функціонал, доступний для середнього користувача.
     */
    MIDDLE_LEVEL,

    /**
     * Розширений рівень відображення.
     * Відповідає повному набору функціоналу або інформації,
     * доступному для продвинутого користувача.
     */
    ADVANCED_LEVEL,
}