package ua.kpi.practical_example_21.ui.theme

import androidx.compose.ui.graphics.Color

// Визначення кольору фіолетового для теми з високим рівнем прозорості (80%)
val Purple80 = Color(0xFFD0BCFF)

// Визначення кольору сірого фіолетового для теми з високим рівнем прозорості (80%)
val PurpleGrey80 = Color(0xFFCCC2DC)

// Визначення кольору рожевого для теми з високим рівнем прозорості (80%)
val Pink80 = Color(0xFFEFB8C8)

// Визначення кольору фіолетового для теми з низьким рівнем прозорості (40%)
val Purple40 = Color(0xFF6650a4)

// Визначення кольору сірого фіолетового для теми з низьким рівнем прозорості (40%)
val PurpleGrey40 = Color(0xFF625b71)

// Визначення кольору рожевого для теми з низьким рівнем прозорості (40%)
val Pink40 = Color(0xFF7D5260)