package ua.kpi.practical_example_9.medium

// ------------------------------------------------------
// Модель
// ------------------------------------------------------
// Клас SolarForecast використовується для представлення прогнозу сонячної енергії.
// Він містить інформацію про ідентифікатор запису, день прогнозу та передбачувану потужність.
data class SolarForecast(
    val id: Int,                    // Унікальний ідентифікатор запису прогнозу
    val day: String,                // День, на який зроблено прогноз (наприклад, "2023-10-01")
    val predictedPower: Double      // Передбачувана потужність сонячної енергії в кВт
)