package ua.kpi.practical_example_1

/**
 * Enum-клас, який визначає рівні відображення (display) для практичного прикладу.
 * Кожен елемент enum представляє різний рівень складності або доступу до інформації.
 */
enum class DisplayFor {
    /**
     * Базовий рівень відображення. Відповідає мінімальному набору інформації.
     */
    BASIC_LEVEL,

    /**
     * Середній рівень відображення. Включає більше деталей, ніж базовий рівень.
     */
    MIDDLE_LEVEL,

    /**
     * Розширений рівень відображення. Найбільш повна інформація з усіма деталями.
     */
    ADVANCED_LEVEL,
}